{
    "claim": "President Joe Biden’s immigration policy was “a giant voter importation scam.”",
    "politico_claim check": "PANTS-FIRE",
    "politico sources": [
        {
            "title": "Full Elon Musk interview at CPAC 2025 amid Trump, DOGE impacting federal workers and more",
            "content_url": "https://www.youtube.com/watch?v=oBEoqiZRIvg",
            "authors": [],
            "_robots": null,
            "published_at": "2025-02-20 15:30:10-08:00",
            "text": ""
        },
        {
            "title": "",
            "content_url": "https://www.cato.org/blog/biden-didnt-cause-border-crisis-part-1-summary",
            "authors": [],
            "_robots": "noindex,nofollow",
            "published_at": "None",
            "text": ""
        },
        {
            "title": "Texas Has 18.6 Million Registered Voters",
            "content_url": "https://www.sos.state.tx.us/about/newsreleases/2024/101924.shtml",
            "authors": [],
            "_robots": null,
            "published_at": "None",
            "text": "Texas Secretary of State Jane Nelson announced that Texas has 18,623,931 registered voters ahead the November 5 election.\n\n“This is a record number and is on target considering population growth and the increased interest around presidential elections,” said Secretary Nelson.\n\nThe 2024 number is 5% higher than the November 2022 number of 17,672,143.\n\nTo see a county-by-county breakdown and historical results, visit the Secretary of State’s page here. The last day to register in time for the November 5 election was October 7.\n\nAs in previous years, the Office of the Secretary of State is conducting a statewide voter education campaign to help make sure Texans understand how to register, important election deadlines, and how to prepare for the polls.\n\nEarly voting in person begins Monday, October 21 and ends November 1. During early voting, Texans may vote at any polling location in their county of registration. For polling locations and what ID to bring to polls, visit VoteTexas.gov — the state’s official online voting resource.\n\n###"
        },
        {
            "title": "Immigration Enforcement and Legal Processes Monthly Tables",
            "content_url": "https://ohss.dhs.gov/topics/immigration/immigration-enforcement/immigration-enforcement-and-legal-processes-monthly",
            "authors": [],
            "_robots": null,
            "published_at": "None",
            "text": "Methodology\n\nData Source\n\nAll data are from the OHSS Persist Dataset except when noted. This is our immigration statistical system of record. We construct the Persist Dataset from DHS immigration components’ operational reports monthly.\n\nWe identify other data sources in table sourcing notes. DHS operational components provide us these other data sources.\n\nDate\n\nAs of January 2025, we update this report monthly on the third Thursday of the month. We receive, process, analyze, and review data before publishing a report. This takes approximately 45 days following the reporting period for the data. For example, January's report will include data through November.\n\nThe newest report reflects our most up-to-date methodology and data. Numbers may differ from previously published figures.\n\nData Processing\n\nOur statisticians clean and validate component operational reports. We use unique record identifiers to deduplicate component data. We convert data to standardized formats according to published reporting standards. Component Statistical Officials validate the standardized formats. Our office and the Component Statistical Officials manage the standards together.\n\nUnit of Measure\n\nExcept as otherwise noted, the unit of measurement for all tables in this report is immigration events. This includes encounters, administrative arrests, and credible fear claims. We count people encountered (or arrested, etc.) more than once during the reporting period multiple times."
        },
        {
            "title": "1 in 10 eligible voters in the U.S. are naturalized citizens",
            "content_url": "https://www.pewresearch.org/short-reads/2024/09/19/1-in-10-eligible-voters-in-the-u-s-are-naturalized-citizens/",
            "authors": [
                "David Kent",
                "Katherine Schaeffer"
            ],
            "_robots": "NOODP",
            "published_at": "2024-09-19 00:00:00",
            "text": "More immigrants than ever before call the United States home. Many of them have become U.S. citizens through naturalization, making them eligible to vote in November’s presidential election. In fact, naturalized citizens’ numbers are growing as the federal government processes citizenship applications at its fastest rate in years.\n\nHere’s a closer look at the nearly 24 million immigrant adults who are naturalized citizens, according to a Center analysis of U.S. Census Bureau data.\n\nThroughout this analysis, we use the terms “eligible voters” and “electorate” to refer to U.S. citizens ages 18 and older.\n\nRelated: What the data says about immigrants in the U.S.\n\nNaturalized citizens make up a record number of eligible voters, according to the 2022 American Community Survey. That year, 23.8 million naturalized citizens were eligible to vote, accounting for about 10% of the U.S. electorate.\n\nThe number of adults who are naturalized citizens has grown steadily in recent decades. Between 2012 and 2022 alone, their numbers grew by 32%, from 18.0 million to 23.8 million. During the same period, the number of U.S.-born adults increased by 8%, from 202 million to more than 217 million.\n\nMost naturalized citizen eligible voters have lived in the U.S. for more than 20 years. About three-quarters of immigrant eligible voters (73%) have lived in the U.S. for more than two decades. Another 20% have lived in the country for 11 to 20 years, while relatively few (8%) have been in the U.S. for a decade or less.\n\nThis pattern reflects the United States’ lengthy citizenship process. Generally, immigrants are required to be lawful permanent U.S. residents for at least five years before they are eligible to apply for citizenship. However, the median number of years before immigrants are eligible for naturalization varies by their country of birth.\n\nAmong naturalized citizen eligible voters, more than half (55%) live in just four states: California, Florida, New York and Texas. These four states are also the country’s most populous when looking at eligible voters overall. Combined, they’re home to roughly a third of the U.S. electorate (32%).\n\nCalifornia has by far the most adult naturalized citizens of any state at 5.6 million, or 23% of the nation’s total.\n\nIn 13 states and the District of Columbia, naturalized citizens make up an estimated 10% of all eligible voters or more. The states where naturalized citizens account for the largest percentage of the electorate are California (21%), New Jersey (19%), New York (19%) and Florida (17%).\n\nIn West Virginia and Mississippi, naturalized citizens make up some of the smallest shares of eligible voters overall – about 1% of the electorate in each state.\n\nThe naturalized citizen share of the electorate differs widely in some potential battleground states in the 2024 election. Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin are widely considered to be among the swing states this fall. The share of eligible voters who are naturalized citizens differs considerably across these states.\n\nIn Nevada and Arizona, naturalized citizens make up 14% and 9% of all eligible voters, respectively. They account for 7% of eligible voters in Georgia, and about 5% in both Pennsylvania and Michigan. In Wisconsin, they are just 3% of the electorate.\n\nIn overall numbers, Georgia’s naturalized citizen electorate is the largest among these swing states at 574,000, while Pennsylvania is not far behind at 546,000. Both of these states were among the closest in the 2020 presidential election.\n\nThe top countries of origin for adult naturalized citizens in the U.S. are Mexico, India, China, the Philippines and Vietnam. About 3.7 million immigrants who are eligible to vote in the U.S. (15%) hail from Mexico – the largest group from any one country. India (8%), China (7%), the Philippines (6%) and Vietnam (4%) round out the top five countries of origin.\n\nThe origin countries of immigrant eligible voters is somewhat in line with U.S. immigration patterns observed over the last six decades or so. Of all immigrants who’ve come to the U.S. since 1965, about a quarter arrived from Mexico. About another quarter came to the U.S. from Asia, with the largest numbers arriving from China, India and the Philippines.\n\nMost immigrants who are eligible to vote are Hispanic or Asian American. These two racial and ethnic groups have grown in number in recent years.\n\nHispanic adults make up the largest share (34%) of immigrant eligible voters as of 2022. About 8.1 million adult naturalized citizens are Hispanic, an increase from 7.5 million in 2018.\n\nAbout three-in-ten immigrant eligible voters (31%) are Asian as of 2022. Nationwide, they account for about 7.5 million adult naturalized citizens, up about half a million people from four years earlier.\n\nThe number and share of White immigrant eligible voters have held relatively steady between 2018 and 2022 at about 4.9 million, or 21% of the total.\n\nThe nation’s 2.5 million Black adult naturalized citizens account for 11% of the immigrant electorate as of 2022 – a similar share to 2018.\n\nThe naturalized citizen electorate differs from the U.S.-born electorate on a variety of demographic measures. Immigrant eligible voters skew older than their U.S.-born counterparts. They’re also somewhat more likely to have a bachelor’s degree, live in households with slightly higher incomes and have lower levels of English proficiency."
        },
        {
            "title": "What we know about unauthorized immigrants living in the U.S.",
            "content_url": "https://www.pewresearch.org/short-reads/2024/07/22/what-we-know-about-unauthorized-immigrants-living-in-the-us/",
            "authors": [
                "Beshay",
                "Jeffrey S. Passel",
                "Jens Manuel Krogstad"
            ],
            "_robots": "NOODP",
            "published_at": "2024-07-22 00:00:00",
            "text": "Note: A data release by the Census Bureau in December 2024 may affect estimates of the size of the unauthorized immigrant population in this blog post. Read this box to learn more.\n\nThe unauthorized immigrant population in the United States grew to 11.0 million in 2022, according to new Pew Research Center estimates based on the 2022 American Community Survey, the most recent year available. The increase from 10.5 million in 2021 reversed a long-term downward trend from 2007 to 2019. This is the first sustained increase in the unauthorized immigrant population since the period from 2005 to 2007.\n\nHowever, the number of unauthorized immigrants living in the U.S. in 2022 was still below the peak of 12.2 million in 2007.\n\nThese new estimates do not reflect events since mid-2022. The U.S. unauthorized immigrant population has likely grown over the past two years, based on several alternative data sources. For example, encounters with migrants at U.S. borders reached record levels throughout 2022-23, and the number of applicants waiting for decisions on asylum claims increased by about 1 million by the end of 2023.\n\nIn addition, through December 2023, about 500,000 new immigrants were paroled into the country through two federal programs – the Cuban, Haitian, Nicaraguan and Venezuelan (CHNV) program and Uniting for Ukraine (U4U). Groups like these have traditionally been considered part of the unauthorized immigrant population, but almost none of them appear in the 2022 estimates.\n\nWhile these new arrivals probably increased the U.S. unauthorized immigrant population, it remains to be seen how much. New arrivals can’t simply be added to the existing estimate because some unauthorized immigrants leave the country every year, some die and some gain lawful status. (For details, read “What has happened with unauthorized migration since July 2022?”)\n\nHere are key findings about how the U.S. unauthorized immigrant population changed recently:\n\nThe number of unauthorized immigrants from Mexico dropped to 4.0 million in 2022 from a peak of 6.9 million in 2007. Mexico has long been, and remains, the most common country of birth for unauthorized immigrants.\n\nFrom 2019 to 2022, the unauthorized immigrant population from nearly every region of the world grew. The Caribbean, South America, Asia, Europe and sub-Saharan Africa all saw increases.\n\nThe unauthorized immigrant population grew in six states from 2019 to 2022 – Florida, Maryland, Massachusetts, New Jersey, New York and Texas. Only California saw a decrease.\n\nAbout 8.3 million U.S. workers in 2022 were unauthorized immigrants, an increase from 7.4 million in 2019. The 2022 number is essentially the same as previous highs in 2008 and 2011.\n\nComposition of the U.S. immigrant population\n\nImmigrants made up 14.3% of the nation’s population in 2022. That share was slightly higher than in the previous five years but below the record high of 14.8% in 1890.\n\nAs of 2022, unauthorized immigrants represented 3.3% of the total U.S. population and 23% of the foreign-born population. These shares were lower than the peak values in 2007 but slightly higher than in 2019.\n\nMeanwhile, the lawful immigrant population grew steadily from 24.1 million in 2000 to 36.9 million in 2022. The growth was driven by a rapid increase in the number of naturalized citizens, from 10.7 million to 23.4 million. The number of lawful permanent residents dropped slightly, from 11.9 million to 11.5 million. As a result, in 2022, 49% of all immigrants in the country were naturalized U.S. citizens.\n\nWho lives with unauthorized immigrants?\n\nUnauthorized immigrants live in 6.3 million households that include more than 22 million people. These households represent 4.8% of the 130 million U.S. households.\n\nHere are some facts about these households in 2022:\n\nIn 86% of these households, either the householder or their spouse is an unauthorized immigrant.\n\nAlmost 70% of these households are considered “mixed status,” meaning that they also contain lawful immigrants or U.S.-born residents.\n\nIn only about 5% of these households, the unauthorized immigrants are not related to the householder or spouse. In these cases, they are probably employees or roommates.\n\nOf the 22 million people in households with an unauthorized immigrant, 11 million are U.S. born or lawful immigrants. They include:\n\n1.3 million U.S.-born adults who are children of unauthorized immigrants. (We cannot estimate the total number of U.S.-born adult children of unauthorized immigrants because available data sources only identify those who still live with their unauthorized immigrant parents.)\n\n1.4 million other U.S.-born adults and 3.0 million lawful immigrant adults.\n\nAbout 4.4 million U.S.-born children under 18 live with an unauthorized immigrant parent. They account for about 84% of all minor children living with their unauthorized immigrant parent. Altogether, about 850,000 children under 18 are unauthorized immigrants in 2022.\n\nThe share of households that include an unauthorized immigrant varies across states. In Maine, Mississippi, Montana and West Virginia, fewer than 1% of households include an unauthorized immigrant. Nevada (9%) has the highest share, followed by California, New Jersey and Texas (8% each).\n\nWhat countries do unauthorized immigrants come from?\n\nThe origin countries for unauthorized immigrants have changed since the population peaked in 2007. Here are some highlights of those changes:\n\nMexico\n\nThe 4.0 million unauthorized immigrants from Mexico living in the U.S. in 2022 was the lowest number since the 1990s. And in 2022, Mexico accounted for 37% of the nation’s unauthorized immigrants, by far the smallest share on record.\n\nThe decrease in unauthorized immigrants from Mexico reflects several factors:\n\nA broader decline in migration from Mexico to the U.S.;\n\nSome Mexican immigrants returning to Mexico; and\n\nExpanded opportunities for lawful immigration from Mexico and other countries, especially for temporary agricultural workers.\n\nThe rest of the world\n\nThe total number of unauthorized immigrants in the U.S. from countries other than Mexico grew rapidly between 2019 and 2022, from 5.8 million to 6.9 million.\n\nThe number of unauthorized immigrants from almost every world region increased. The largest increases were from the Caribbean (300,000) and Europe and Canada (275,000). One exception was Central America, which had led in growth until 2019 but saw no change after that.\n\nAfter Mexico, the countries with the largest unauthorized immigrant populations in the U.S. in 2022 were:\n\nEl Salvador (750,000)\n\nIndia (725,000)\n\nGuatemala (675,000)\n\nHonduras (525,000)\n\nThe Northern Triangle\n\nThree Central American countries – El Salvador, Honduras and Guatemala – together represented 1.9 million unauthorized immigrants in the U.S. in 2022, or about 18% of the total. The unauthorized immigrant population from the Northern Triangle grew by about 50% between 2007 and 2019 but did not increase significantly after that.\n\nOther origin countries\n\nIn 2022, Venezuela was the country of birth for 270,000 U.S. unauthorized immigrants. This population had seen particularly fast growth, from 55,000 in 2007 to 130,000 in 2017. It is poised to grow significantly in the future as new methods of entry to the U.S. are now available to Venezuelans.\n\nOther countries with large numbers of unauthorized immigrants have also seen increases in recent years. Brazil, Canada, Colombia, Ecuador, India, and countries making up the former Soviet Union all experienced growth from 2019 to 2022.\n\nHowever, other countries with significant unauthorized immigrant populations showed no change, notably China, the Dominican Republic and the Philippines.\n\nDetailed table: Unauthorized immigrant population by region and selected country of birth (and margins of error), 1990-2022 (Excel)\n\nWhich states do unauthorized immigrants call home?\n\nMost U.S. states’ unauthorized immigrant populations stayed steady from 2019 to 2022. However, six states showed significant growth:\n\nFlorida (+400,000)\n\nTexas (+85,000)\n\nNew York (+70,000)\n\nNew Jersey (+55,000)\n\nMassachusetts (+50,000)\n\nMaryland (+40,000)\n\nCalifornia (-120,000) is the only state whose unauthorized immigrant population decreased.\n\nStates with the most unauthorized immigrants\n\nThe six states with the largest unauthorized immigrant populations in 2022 were:\n\nCalifornia (1.8 million)\n\nTexas (1.6 million)\n\nFlorida (1.2 million)\n\nNew York (650,000)\n\nNew Jersey (475,000)\n\nIllinois (400,000)\n\nThese states have consistently had the most unauthorized immigrants since at least 1980. However, in 2007, California had 1.2 million more unauthorized immigrants than Texas. Today, with the declining number in California, it has only about 150,000 more. The unauthorized immigrant population has also become considerably less geographically concentrated over time. In 2022, the top six states were home to 56% of the nation’s unauthorized immigrants, down from 80% in 1990.\n\nDetailed table: Unauthorized immigrant population for states (and margins of error), 1990-2022 (Excel)\n\nDetailed table:Unauthorized immigrants and characteristics for states, 2022 (Excel)\n\nUnauthorized immigrants in the labor force\n\nThe number of unauthorized immigrants in the U.S. workforce grew from 7.4 million in 2019 to 8.3 million in 2022. The 2022 number equals previous highs in 2008 and 2011.\n\nUnauthorized immigrants represent about 4.8% of the U.S. workforce in 2022. This was below the peak of 5.4% in 2007.\n\nSince 2003, unauthorized immigrants have made up 4.4% to 5.4% of all U.S. workers, a relatively narrow range.\n\nThe share of the U.S. workforce made up by unauthorized immigrants is higher than their 3.3% share of the total U.S. population. That’s because the unauthorized immigrant population includes relatively few children or elderly adults, groups that tend not to be in the labor force.\n\nDetailed table: Unauthorized immigrants in the labor force for states, 2022 (Excel)\n\nThe share of unauthorized immigrants in the workforce varied across states in 2022. Nevada (9%), Texas (8%), Florida (8%), New Jersey (7%), California (7%) and Maryland (7%) had the highest shares, while fewer than 1% of workers in Maine, Montana, Vermont and West Virginia were unauthorized immigrants.\n\nNote: This is an update of a post originally published Nov. 16, 2023."
        },
        {
            "title": "Where Immigrant Neighborhoods Swung Right in the Election",
            "content_url": "https://www.nytimes.com/interactive/2020/12/20/us/politics/election-hispanics-asians-voting.html",
            "authors": [
                "Weiyi Cai",
                "Ford Fessenden"
            ],
            "_robots": "noarchive, max-image-preview:large",
            "published_at": "2020-12-20 00:00:00",
            "text": "Across the United States, many areas with large populations of Latinos and residents of Asian descent, including ones with the highest numbers of immigrants, had something in common this election: a surge in turnout and a shift to the right, often a sizable one.\n\nThe pattern was evident in big cities like Chicago and New York, in California and Florida, and along the Texas border with Mexico, according to a New York Times analysis of voting in 28,000 precincts in more than 20 cities.\n\nJoseph R. Biden Jr. beat President Trump in almost all of these places en route to his record popular vote victory. But the red shifts, along with a wave of blue shifts in Republican and white areas, have scrambled the conventional wisdom of American politics and could presage a new electoral calculus for the parties.\n\nThousands of new voters across the country turned out in areas with significant numbers of Latinos and residents of Asian descent — populations whose participation in past elections has lagged. And over all, Mr. Trump, whose policies and remarks were widely expected to alienate immigrants and voters of color, won the lion’s share of the additional turnout.\n\nIt’s true that not all of the residents of these areas are immigrants, and many of those born abroad are not citizens and so are ineligible to vote. But typically, immigrants settle in places where others like them already live, and their presence is a bellwether of similar populations and successive generations of earlier immigrants.\n\nWith only a few exceptions, all of these areas continued to be Democratic strongholds, giving more votes to Mr. Biden by substantial margins. But in a divided American electorate, any shift can be consequential. Already the shift appears to have changed outcomes in a number ofcongressional races.\n\nAsian-Americans and Latinos are growing parts of the American electorate. Currently, about 13 percent of eligible voters are Hispanic, and 4 percent are Asian-American. By 2032, Hispanic voters are predicted to make up 18 percent of the electorate and the Asian-American share is also expected to grow.\n\nThe chronically low turnout in both groups has been a continuing riddle, but the voters in each group — while widely diverse in background, income and outlook — had leaned heavily Democratic over all. And they had been viewed as likely to tip the scales for Democrats in the future.\n\nLatino growth in particular had figured in experts’ predictions of the decline of Republican influence in battleground states like Texas, Florida and Arizona. That could change, however, with the 2020 turnout surge and Mr. Trump’s success at peeling off voters.\n\n“There remains a huge reservoir of Latino nonvoters and low-propensity voters,” said Roberto Suro, a professor of journalism and public policy at the University of Southern California. “And if increased turnout improves the G.O.P. share, that would overturn a great deal of conventional wisdom about the political impact of demographic change.”\n\nThe Times analysis also shows that in urban and suburban precincts with the highest proportion of white voters, turnout also rose steeply, but Mr. Trump’s margin declined in those places, compared with 2016. It also fell in Republican precincts: In 3,600 of the 5,000 precincts where he beat Mrs. Clinton, Mr. Trump's margin in 2020 was lower than it was in 2016.\n\nBut even as Mr. Trump lost ground in white and Republican areas in and around cities — ultimately leading to his election loss — he gained new votes in immigrant neighborhoods.\n\nThere were substantial variations in the level of turnout and in the magnitude of the shift in different populations, including large shifts and turnout in Cuban precincts; huge turnout and milder shifts in Mexican precincts in Arizona; and big shifts and modest turnout in Dominican neighborhoods of New York City. But almost everywhere, there was a turnout increase, and a rightward shift.\n\nThe Times analysis included 5,700 precincts in which the combined population of Latinos and people of Asian descent was 65 percent or more. In these places, the margin shifted toward the president by an average of 13 points.\n\nThe long-anticipated purpling of Republican Texas that was supposed to come as more Latinos joined the electorate was certainly nowhere in evidence on Election Day.\n\nMr. Trump’s most sizable gains outside of Miami were in the Rio Grande Valley in the predominantly Hispanic areas along the border with Mexico, including Hidalgo County, home to McAllen.\n\nIn San Antonio, the nation’s biggest majority Latino city, turnout was up nearly 30 percent. Democrats hoped to flip the 23rd Congressional District in southwest Texas, including much of the city, but failed.\n\nIn fact, Democrats had spent lavishly in attempts to win Republican congressional seats in suburban areas around the other big cities as well.\n\n“They were banking to win on the backs of Black and brown and Asian voters,” said Chuck Rocha, a Latino organizer who was a senior adviser to Senator Bernie Sanders during the primaries. “They lost all of these areas.”\n\nIn Dallas and Fort Worth, the trend held in areas that are predominantly Latino even as mostly white areas drove the counties left in the presidential race.\n\nAcross Texas, the red shifts were most pronounced in precincts with the highest proportion of Latinos. The Democratic margin in 80 percent Latino precincts dropped an average of 17 percentage points.\n\nIn Santa Clara County, home to Silicon Valley, some of the strongest shifts to the right were in precincts with sizable populations of residents of Vietnamese descent in San Jose. Precincts with large populations of residents of Indian and Chinese descent had rightward shifts, but they were not as pronounced.\n\nThe reasons behind the new crosscurrents in the American polity will be debated for years to come.\n\nSome Latino Democrats argue that the eddies of this shift are less important than the tide of Latinos — and Asian-Americans as well — who still voted mostly for Mr. Biden, and who deserve a large share of credit for Mr. Trump’s defeat.\n\n“So far, the white-person-driven narrative to blame Hispanics has been utterly racist, given that a strong majority of white people voted to re-elect Trump and a majority of Hispanics voted for Biden,” said Matt A. Barreto, a political scientist at the University of California at Los Angeles and a founder of the polling firm Latino Decisions, who worked for the Biden campaign.\n\nIndeed, in Maricopa County in Arizona, home to Phoenix, the overall turnout even in Latino precincts that shifted right was so large that it added far more votes to Mr. Biden’s totals than Mr. Trump’s, and was instrumental in turning the state blue, in spite of the shift.\n\nRepublicans argue that the election represents the beginnings of a realignment of conservative, religious working people in immigrant communities and communities of color into their party.\n\n“#Florida & the Rio Grande Valley showed the future of the GOP,” Senator Marco Rubio, Republican of Florida, tweeted after the election. “A party built on a multi-ethnic multi-racial coalition of working AMERICANS.”\n\n“The Latino conservatives feel a lot of momentum,” said Geraldo L. Cadava, a professor at Northwestern University and author of a book on Latino Republicans. They had argued that Mr. Trump could win Latino voters, not with the Bushesque strategy of moderation on immigration, but with a Reaganesque message of personal responsibility and hard work, he said.\n\nAnd Mr. Trump spent money reaching out.\n\n“It’s a split-screen reality,” Dr. Cadava said. “On one hand, there are the tweets, and Trump giving Stephen Miller free rein to do the worst things imaginable. But at the same time, they are articulating a broad-based appeal to Latinos based on the economy and freedom of religion.”\n\nRuy Teixeira, a senior fellow at the liberal Center for American Progress, said he worried before the election that Democrats’ focus on racial justice issues came at the expense of outreach about easing the lives of hard-pressed workers.\n\n“In general, it suggests that Democrats’ theory of the case — that their electoral problems were all about race rather than class — was incorrect,” he said.\n\nMr. Rocha, the Sanders organizer, lamented the Democrats’ failure to make a strong case to Latino and Asian-American voters, and he acknowledged that the president’s bully pulpit and deep pockets could have made a difference.\n\n“When you have a candidate who has 1,000 percent name ID and is spending a lot of money, if you lie long enough about having a horse, someone will buy you a saddle,” he said. “New immigrant voters are infrequent voters, and they’re hungry for information. We need to have Democrats telling our immigration story.”"
        },
        {
            "title": "Abbott likely inflated how many noncitizens were removed from voter rolls",
            "content_url": "https://www.votebeat.org/texas/2024/10/15/greg-abbott-noncitizen-voter-roll-removal-investigation/",
            "authors": [
                "Vianna Davila",
                "Lexi Churchill",
                "Natalia Contreras",
                "James Barragán",
                "Hayley Harding",
                "Jessica Huseman",
                "Jen Fifield",
                "Alexander Shur"
            ],
            "_robots": "noarchive",
            "published_at": "2024-10-15 00:00:00",
            "text": "Votebeat is a nonprofit news organization reporting on voting access and election administration across the U.S. Sign up for Votebeat Texas’ free newsletter here.\n\nThis article is co-published with ProPublica, a nonprofit newsroom that investigates abuses of power, and with The Texas Tribune, a nonprofit and nonpartisan newsroom that engages with Texans. Sign up to receive ProPublica’s biggest stories here and The Texas Tribune’s newsletters here.\n\nIn late August, with a hotly contested presidential election less than three months away, Texas Gov. Greg Abbott boasted that the state had removed more than 1 million ineligible voters from its rolls, including more than 6,500 noncitizens.\n\nThe Republican governor said the Texas secretary of state’s office was turning over nearly 2,000 of those characterized as noncitizens to Attorney General Ken Paxton for investigation, because records showed they had a voting history.\n\n“Illegal voting in Texas will never be tolerated,” Abbott said in a press release.\n\nThe former registered voters whom Abbott called noncitizens, and the other people removed from the rolls since September 2021, were taken off through a routine practice local election officials conduct that includes culling the names of people who have moved or died. Election experts have urged caution in using the numbers to make definitive statements about registered noncitizens.\n\nBut Abbott did just that, initially stating in his news release that thousands of noncitizens had been stripped from the rolls.\n\nHis office then edited the press release after publication, softening it by adding the word “potential” before noncitizens.\n\nAbbott’s claims helped to fan ongoing unsubstantiated Republican allegations that noncitizens plan to cast ballots en masse to sway elections for Democrats, assertions that former President Donald Trump and his party are using to cast doubt on the integrity of the upcoming November election.\n\nAn investigation by ProPublica, The Texas Tribune, and Votebeat, however, found that the governor’s claims about noncitizens on the rolls appear inflated and, in some cases, wrong.\n\nThe secretary of state’s office identified 581 people, not 6,500, as noncitizens, according to a report it gave Abbott in late August that the newsrooms obtained through a public information request.\n\nIn response to questions about the basis for Abbott’s larger number, the secretary of state’s office told the news organizations that it had “verbally” provided the governor’s office with a separate number of people removed from the rolls who failed to respond to letters alerting them that there were questions about their citizenship.\n\nThe governor’s news release combined the two figures.\n\nThat means U.S. citizens who simply never received or responded to such letters are almost certainly included in Abbott’s 6,500 number. Abbott did not respond to requests for comment, and Secretary of State Jane Nelson declined to be interviewed.\n\nAfter attempting to contact more than 70 people across both categories, the news organizations have so far found at least nine U.S. citizens in three Texas counties who were incorrectly labeled as noncitizens or removed from the rolls because they did not respond to the letters about their citizenship. In each case, they showed reporters copies of their birth certificates to confirm their citizenship, or reporters verified their citizenship using state records.\n\nOne of them is 21-year-old Jakylah Ockleberry.\n\nOckleberry, a native Texan who provided the news organizations with a copy of her birth certificate, had left the state only twice in her life, including a recent trip to California.\n\nShe said she had no idea Travis County had mislabeled her as a noncitizen until the news organizations contacted her. “How would something like that happen?” she said.\n\nWhen the governor’s press release came out, election experts and local officials were worried about cases such as Ockleberry’s, saying the press release implied officials had confirmed the noncitizen status of 6,500 people when they had not.\n\nFive years ago, Texas officials suggested that nearly 100,000 noncitizens were registered to vote and that nearly half of them had cast ballots. Those claims quickly unraveled under scrutiny and spurred a lawsuit and settlement that now governs how Texas can flag someone as a potential noncitizen.\n\nAsked whether the nine people the news organizations identified as U.S. citizens were included in Abbott’s latest figure, the secretary of state’s office said it could not confirm or deny the inclusion of any specific people. Local election officials said they don’t know which voters were included in Abbott’s tally, but emphasized the data originates at the county level.\n\nThe discrepancies show the pitfalls inherent in using this data to make assertions about noncitizens.\n\nIn Ockleberry’s case, as well as those of four others the newsrooms identified in Travis County, election workers should have selected a code that indicated the voters had moved. Instead, they mistakenly selected a code for noncitizens.\n\nBruce Elfant, the Travis County tax assessor-collector and voter registrar, acknowledged the errors made by his office. He also said the numbers suggested that noncitizen voting “is an infinitesimal, small issue.”\n\nRoutine maintenance of voter rolls is important, and if noncitizens are registered, they should be removed, said Marc Meredith, a professor of political science at the University of Pennsylvania and an expert on election administration.\n\nBut Meredith said Abbott’s decision to announce without explanation that 6,500 noncitizens were removed from the rolls, and to initially do so without qualifying that these were only potential noncitizens, “reduces trust in the Texas voter registration process in an unnecessary way.”\n\nRoutine maintenance, political purpose\n\nVoter rolls are naturally fluid. People move, die, become citizens, and turn 18. Election officials across the country are constantly adding and removing people for legitimate reasons.\n\n“So long as we have requirements about keeping lists clean, and so long as we don’t have a police state that has a single database with all of our names in it, like in much of the rest of the world, including democratic nations, we’re going to come across these sorts of problems,” said Charles Stewart III, director of the MIT Election Data and Science Lab.\n\nElfant, for one, said he was frustrated by Abbott’s public promotion of voter removal data. He said the governor’s press release created confusion among residents who feared they might have been wrongly removed and would not be able to cast ballots in the upcoming presidential election.\n\n“It scared a lot of people. We’ve received a lot of phone calls and emails from people who are concerned that they’re not on the voter rolls,” Elfant said.\n\nAny number of things can trigger a question about a voter’s eligibility.\n\nFor example, county registrars contact anyone who has marked on a jury summons that they’re not a citizen. The registrars need to confirm if that’s true, because it would mean the person is also ineligible to vote. The secretary of state’s office also gets information weekly from the Texas Department of Public Safety about people who have signed up for licenses and state identification and identified themselves as noncitizens. That information is then sent to counties.\n\nIn such cases, county election officials must follow up. They are required by law to notify voters and give them 30 days to respond before they’re removed from the rolls.\n\nBut election officials know those safeguards don’t always work.\n\n“The post office messes up. We get a lot of cards back or mail back that says ‘undeliverable,’ and the person will be like, ‘I’ve lived at this address for 20 years and I’ve never moved,’” said Trudy Hancock, elections administrator in Republican-leaning Brazos County, home to Texas A&M University. “So you have to consider that there are outside circumstances that can affect our efforts to reach them.”\n\nFailure to respond to a letter questioning someone’s citizenship is not a confirmation that they are not a citizen, election officials said.\n\nThe 2019 episode, when the secretary of state’s office announced that it had identified 95,000 registered voters as potential noncitizens and said that more than half of them had previously cast ballots, highlighted failures in the process.\n\nPaxton, the attorney general, immediately turned to social media, posting “VOTER FRAUD ALERT.” Abbott thanked Paxton and the secretary of state’s office on Twitter for “uncovering and investigating this illegal vote registration.” Trump also piled on with a tweet calling the state’s numbers “just the tip of the iceberg.”\n\nVoting rights groups sued, decrying the state’s efforts as deliberate attempts to suppress the votes of actual citizens. Texas’ assertions didn’t hold up. Many of the flagged registered voters turned out to be naturalized citizens whom the state incorrectly identified as ineligible because it was using outdated DPS data from driver’s license and state identification card applications. (DPS did not respond to a request for comment for this story.)\n\nThe state settled the case and agreed to flag people with the secretary of state’s office only if they identify as noncitizens when applying for a new ID with DPS and if they previously registered to vote.\n\nState officials should be transparent about how they arrived at the latest assertions, said David Becker, executive director and founder of The Center for Election Innovation & Research.\n\nWith the August press release, the state appears to have presented a figure without fully explaining its methodology or double-checking the information, said Becker, who is a former senior trial attorney in the voting section of the U.S. Justice Department’s Civil Rights Division.\n\nIf the governor presented this data in a court of law without evidence, Becker believes it wouldn’t stand up to scrutiny.\n\n“Their claims would likely be dismissed until they could come up with something that actually documents how they got to those numbers,” he said.\n\nLabeled noncitizens\n\nWhen Justin Comer, 29, heard that the state had removed thousands of noncitizens from the voter rolls, it never occurred to him that he might be one of them. Comer was born in Harris County, the home of Houston, and grew up in conservative Montgomery County just outside the city. He said he’d been registered to vote there since he was 18 and had cast ballots in presidential elections since then.\n\n“I’ve always been interested in especially local politics, and just making sure I stay up to date with that,” Comer said in a phone interview. “I’m always pushing my wife now, I’m like, ‘Hey, we need to stay active in that respect and do our part.’”\n\nIt wasn’t until the news organizations contacted him that he made the connection between a peculiar voter registration issue he encountered last year and the Republican leaders’ sweeping noncitizen voting claims.\n\nIn 2023, he received a notice from the county elections office that he’d been flagged as a potential noncitizen. He needed to show proof of his citizenship in the next 30 days or his registration would be canceled, the notice said. The letter Comer received indicated he’d said he wasn’t a citizen in a response to a jury summons. Comer assumes he clicked the wrong button when responding to the notice online; he had meant to reply that he had moved. He’s now registered to vote in Collin County, where he lives.\n\n“I was more just confused,” Comer said. “I’ve lived in Texas my whole life. It was never a question for me.”\n\nIn some cases, it’s unclear what happened. Diana Colon spent much of her life in the mountains of Puerto Rico, in the town of Aibonito, but moved to El Paso County on the far western edge of Texas in 2018 to be closer to her daughter.\n\nShe was surprised when she learned the county had kicked her off its voter rolls after she apparently failed to respond to a question about her citizenship. Puerto Rico is a U.S. territory, and she is an American citizen. She showed a copy of her birth certificate to a reporter.\n\n“That’s crazy,” she said.\n\nColon does not recall registering to vote, though the county said it received an application from her at some point in which she did not answer a question about her citizenship. Public information the county provided the news organizations indicated she was flagged as a potential noncitizen in DPS data.\n\nColon has since moved to California but would like to return to the El Paso area and would register to vote, if only to clear up the fact that she can. “I wouldn’t like people saying I’m not a U.S. citizen,” she said in an interview.\n\nThere are almost certainly additional U.S. citizens among the thousands of removed voters Abbott characterized as noncitizens. For example, reporters identified Texas birth certificates for another two voters whose registrations in Montgomery County were canceled for not responding to questions about their citizenship. The news organizations could not reach those voters for comment.\n\nNoncitizens have occasionally voted, but experts say these cases are rare and there is no evidence that they affect election outcomes. Noncitizens who vote face criminal penalties, including the loss of their residency status and deportation. In 2017, Rosa Ortega, a U.S. permanent resident living in North Texas, said she believed her green card authorized her to vote and cast five ballots over a decade. A Tarrant County jury convicted her of voter fraud and sentenced her to eight years in prison.\n\nMeredith, the University of Pennsylvania elections expert, said he wouldn’t be surprised if some people removed from the Texas rolls are indeed noncitizens who had cast ballots in a previous election. But that doesn’t mean the problem is widespread. “You shouldn’t use the fact there may be a few as evidence that it happens all the time,” Meredith said.\n\nReporters also found some noncitizens, including two who said they had inadvertently registered after receiving what they said were unsolicited voter registration applications, an ongoing concern for Republicans who believe this kind of outreach will result in large numbers of noncitizens signing up to cast a ballot. One got the application from a voting advocacy group. But the other got it while filling out other state paperwork.\n\nIn both cases, they had truthfully filled out the form and said they were noncitizens. Neither one voted. Election workers in the two counties involved, Collin and Travis, said those voter registration applications should not have been processed, because the applicants identified themselves as noncitizens, and both people were added to the rolls through clerical error.\n\nOne of them, Austin resident Son Mai, said he had no idea he had ever been on the rolls until a reporter contacted him.\n\nThe news organizations viewed three voter registration applications from Mai in which he checked a box saying he was not a U.S. citizen. They interviewed Mai, who is originally from Vietnam and speaks limited English, through an interpreter.\n\nMai, who has been a permanent resident and green card holder for over 40 years, receives Social Security disability benefits and food stamps. Voter registration applications are included with that paperwork, which he believes is how he was mistakenly signed up.\n\nHowever, Mai always marked that he is not a U.S. citizen on the forms, the county confirmed. As a result, Travis County should have automatically rejected his application, but elections officials said he was accidentally added to the rolls instead. The county confirmed Mai has never voted, though he said he hopes to become a naturalized citizen.\n\n“I told them I couldn’t vote,” he told the reporters. “I never vote.”\n\nBuilding a case\n\nWith the election less than a month away, claims about noncitizen voting have continued to ratchet up despite numerous elections experts saying such instances are very rare. These efforts can have significant consequences.\n\nThe Republican National Committee filed a lawsuit last month in Nevada alleging that nearly 4,000 noncitizens may have cast ballots in the 2020 presidential election and that thousands could vote in the coming election. (Nevada’s former secretary of state, who is Republican, did not find evidence to substantiate the 2020 claims during an investigation at the time.)\n\nLast month, the Justice Department filed suit against Alabama after its secretary of state flagged more than 3,000 alleged noncitizens and instructed county officials to remove any noncitizens from their voter rolls, although systematic voter roll cleaning is illegal so close to a federal election. In a statement, the Justice Department said its review found that naturalized and native-born American citizens had been caught up in the effort.\n\nIn Texas, both Abbott and Paxton have promoted claims of noncitizens seeking to vote in the November election.\n\nOn a single day in August, Paxton said his office would investigate an allegation that nonprofits were setting up booths outside state driver’s license offices and signing up noncitizens to vote, which followed an unfounded claim peddled by a Fox News host, and announced his agency had raided homes in three South Texas counties to investigate allegations of voter fraud. The next day, the attorney general appeared on the radio show of conservative personality Glenn Beck pushing debunked claims that President Joe Biden is allowing immigrants to enter the country illegally so they can vote for Democrats in elections.\n\nIn recent weeks, Paxton put out a flurry of news releases, continuing the hunt for noncitizen voters.\n\nPaxton, who did not respond to a request for comment, sent a public letter to Nelson, the secretary of state, last month urging her to demand the federal government’s assistance in identifying potential noncitizens on the rolls.\n\nBut Nelson, a Republican and an Abbott appointee, apparently didn’t move aggressively enough for Paxton. In an Oct. 2 news release, the attorney general expressed frustration with Nelson, saying she had not provided the federal government any information about the possible noncitizens. He then asked Nelson’s office to provide him with the list of names so he could send it on to the government himself.\n\nHours later, Nelson provided Paxton the voter records for anyone who does not have a Texas driver’s license or identification card number on file in its statewide voter registration system. The list was accompanied by an explicit warning.\n\n“The records do not reflect, and are in no way indicative of, a list of potential non-United States citizens on the State’s voter rolls,” Nelson wrote.\n\nDan Keemahill of ProPublica and The Texas Tribune, Alejandra Martinez of The Texas Tribune, and Thomas Wilburn of Votebeat contributed data research and reporting."
        },
        {
            "title": "The White House exaggerated how sharply illegal immigration has dropped. Here’s what you should know",
            "content_url": "https://www.politifact.com/article/2025/feb/20/the-white-house-exaggerated-how-sharply-illegal-im/",
            "authors": [
                "Maria Ramirez Uribe"
            ],
            "_robots": "all",
            "published_at": "2025-02-20 00:00:00",
            "text": "One month since President Donald Trump was sworn in as president, the White House is touting the administrations’ successes, including a sharp drop in illegal immigration.\n\n\"Daily illegal alien encounters plummet 95% under President Trump,\" read a graphic posted Feb. 15 on the White House’s Instagram account.\n\nAn accompanying bar graph showed the number \"20,086\" next to a photo of former President Joe Biden and the figure \"1,041\" next to a photo of Trump — a 95% drop, a big green arrow indicated.\n\nThe post’s second slide declared another dramatic plunge: \"President Trump’s border policies slash illegal alien gotaways by 93%,\" it said, showing Biden’s number at \"1,800\" and Trump’s at \"132.\"\n\nIllegal immigration at the U.S. southern border has dropped since Trump entered the White House. But the White House’s data use is misleading.\n\nThe post’s claims also overemphasize the data from a short time period; history shows immigration trends ebb and flow no matter who is in office. We won’t know the full effect of Trump’s policies compared with Biden’s until we are able to zoom out over a longer period of time. For now, it’s unclear whether any drop in illegal immigration will last or for how long.\n\nHere are the facts.\n\nUsing two different data points inflates the drop in illegal immigration under Trump\n\nThe White House pointed us to a Fox News Instagram post that showed a chart similar to the one the Trump administration used.\n\nText over a photo of Biden read, \"20,086 daily encounters (in the) last seven days of (the) Biden administration.\" Below it, a photo of Trump was captioned \"1,041 daily encounters (in the) first seven days of (the) Trump administration.\"\n\nBut, like the White House’s post, Fox News’ post is misleading. It uses the total number of border encounters for Biden’s last seven days in office and compares it with a daily average for Trump’s first seven days in office.\n\nHere’s the data broken down, according to a Jan. 28 Fox News article that cited unpublished U.S. Customs and Border Protection data:\n\nBorder officials encountered migrants trying to cross the U.S. southern border 20,086 times during Biden’s last seven days in office. That’s an average of 2,869 times a day.\n\nDuring Trump’s first seven days, border officials encountered migrants trying to cross the U.S. southern border 7,287 times. An average of 1,041 times a day.\n\nThat’s a 60% drop, not a 95% drop as the White House claimed in its Instagram post.\n\nAdditionally, the White House and Fox News are using encounters both at official ports of entry and between them. Under Biden’s administration, people could make appointments at official ports of entry and be legally allowed to enter the U.S. to seek asylum. Those appointments still counted as encounters, even though they did not not represent illegal immigration. Trump ended that program on his first day in office and cancelled all existing appointments.\n\nPolitiFact reached out to U.S. Customs and Border Protection for daily January encounters data, at and between ports of entry, but the agency did not respond. The latest publicly available data is for the whole month of January.\n\nBorder Patrol Chief Michael Banks said in a Jan. 29 X post that there was a 55% drop in encounters between ports of entry from the seven-day-period starting Jan. 16 to the period starting Jan. 23.\n\nIllegal immigration ebbs and flows, so it’s unclear how long any drop will last\n\nThere are important caveats to keep in mind when any administration touts illegal immigration drops.\n\nThe White House relied on seven days of immigration data to conclude that illegal immigration has plummeted because of Trump’s policies. But it’s important to zoom out and look at immigration trends over a longer period of time.\n\nThere has been a sharp drop in illegal immigration from December 2024 to January 2025. And it’s likely that Trump’s hard-on-immigration approach has played a role.\n\nBut illegal immigration has generally been dropping since March 2024. And it dropped significantly after June, when Biden implemented a policy limiting people’s ability to apply for asylum at the southwest border. For example, there were more than 137,000 encounters at the southern border in March 2024 compared to more than 47,000 in December.\n\nAdditionally, immigration experts have often told us that weather patterns, such as extremely cold or hot conditions, changes in administration and policies or political shifts in people’s home countries can affect whether someone migrates. So it’s uncertain what causes a drop or how long it will last.\n\nDuring Trump’s first term, illegal immigration at the southern border dropped sharply after he entered office, similarly to what we have seen at the start of his second term. But soon after rose steadily, month after month. It went back down in 2020, during the COVID-19 pandemic. In the months before Trump left office, illegal immigration was rising again.\n\nThe number of people who have evaded border officials started dropping before Trump\n\nThe second slide from the White House’s Instagram post focused on \"gotaways\" — a term immigration officials use to describe people who cross the border without being stopped.\n\nBut the Fox News post the White House pointed us to misleads by comparing a full year of data (1,800 gotaways per day in fiscal year 2023) to a few days or weeks of data (132 per day under Trump) — it was unclear precisely what time period under Trump that statistic referred to.\n\nFocusing on 2023 data in particular also presents accuracy problems for the comparison.\n\nFox News received gotaways statistics for fiscal year 2023 after submitting a Freedom of Information Act request, its Feb. 11 article said. Although we were not able to substantiate the precise data it relied on, we know that fiscal year 2023 represented the highest rates of illegal immigration under Biden.\n\nOfficial gotaways data is published once a year and represents years-old data. The most recent publicly available data is from the Department of Homeland Security’s 2022 Metrics Report, which shows fiscal year 2021 data.\n\nLike encounters, gotaways numbers had also been steadily dropping, before Trump came into office.\n\nA Department of Homeland Security statement Jan. 17 said the number of gotaways in fiscal year 2024 had dropped by 60% from the year before. That would mean, using Fox News’ gotaways data for fiscal year 2023, there were around 268,000 gotaways in 2024 or an average of 735 a day.\n\nPolitiFact Chief Correspondent Louis Jacobson contributed to this report."
        },
        {
            "title": "Elon Musk is wrong to say Joe Biden is recruiting immigrants to create a Democratic majority",
            "content_url": "https://www.politifact.com/factchecks/2024/feb/06/elon-musk/elon-musk-is-wrong-to-say-joe-biden-is-recruiting/",
            "authors": [
                "Amy Sherman"
            ],
            "_robots": "all",
            "published_at": "2024-02-06 00:00:00",
            "text": "Days before senators unveiled a immigration bill aimed at slowing illegal immigration, Elon Musk riffed on a common myth that Democrats want mass illegal immigration to gain more voters.\n\n\"Biden’s strategy is very simple: 1. Get as many illegals in the country as possible. 2. Legalize them to create a permanent majority – a one-party state,\" Musk posted Feb. 2 on X. \"That is why they are encouraging so much illegal immigration. Simple, yet effective.\"\n\nOver one week, Musk posted about immigration about two dozen times; another post said that \"every deportation is a lost vote.\" The morning after a trio of bipartisan senators unveiled the immigration bill, Musk wrote, \"The long-term goal of the so-called ‘Border Security’ bill is enabling illegals to vote! It will do the total opposite of securing the border.\"\n\nMusk’s statement echoes a recent statement by former President Donald Trump, who said, \"That’s why they are allowing these people to come in — people that don’t speak our language — they are signing them up to vote.\" We rated that Pants on Fire.\n\nSuch statements align with conspiracy theories about the \"great replacement,\" which claim white people of European descent are deliberately being replaced with nonwhite people.\n\nMusk provided no evidence to show such a Biden strategy exists. And the claim doesn’t add up, because it takes immigrants years to become U.S. citizens, and there’s no guarantee that immigrants who gain citizenship will vote for Democrats.\n\nWe emailed the X press account and received an automatic reply saying, \"busy now, please check back later.\"\n\nIt takes many years for immigrants to become voting citizens\n\nMusk called this alleged strategy \"very simple\" and \"effective,\" but it’s neither.\n\nFederal law requires citizenship as a condition to vote in national elections. Gaining citizenship can take a decade or longer.\n\nInteracting with the government, including trying to vote, is something immigrants in the country illegally try to avoid, Mike Madrid, a Republican strategist, previously told PolitiFact: \"They are not going to go register to vote and expose themselves.\"\n\nOccasionally, noncitizens have been prosecuted for voting. When noncitizens register to vote, it is often in error.\n\nBiden supports new Senate bill that doesn’t have path to citizenship\n\nMusk’s X post included a screenshot of a January 2021 Associated Press article about Biden’s plan to ask Congress to create a path for citizenship for immigrants in the country illegally. But Biden’s efforts stalled because his proposed 2021 bill did not advance.\n\nBiden has said if it passes, he will sign the new Senate legislation that is considerably tougher on immigration. If fully implemented, the proposed legislation would decrease the number of immigrants permitted into the country because of its higher standard to be considered for asylum.\n\nIt’s unclear whether the bill has the votes to pass the Senate. House Speaker Mike Johnson, R-La., has said it is dead on arrival.\n\nMichelle Mittelstadt, a spokesperson for the nonpartisan Migration Policy Institute, said the new legislation \"does not provide any path to citizenship for anyone currently in the country illegally and would not in any way expedite legal permanent residence for any future border arrivals.\"\n\n\"It takes on average 5 years in green card status before a person can become a U.S. citizen, so no one would instantly gain the right to vote,\" Mittelstadt said.\n\nAnd there is no guarantee that immigrants who become citizens will vote for Democrats.\n\nExperts have told us it’s ridiculous to make assumptions about how immigrants crossing the border now will vote in the future if they gain citizenship.\n\nMusk’s comments spread misinformation about elections\n\nSince Musk bought Twitter for $44 billion in 2022, the platform now known as X has removed guardrails designed to restrict the flow of mis- and disinformation.\n\nIt’s easy to discount such \"conspiracy theory nonsense\" from random trolls on X, but it’s powerful when it comes from Musk who owns the platform, said Anthony Gutierrez, executive director of Common Cause Texas, a group that advocates for voting rights.\n\nDemocracies require participation, and falsehoods \"only increase the likelihood that people will lose faith in our elections and simply opt out,\" Gutierrez said.\n\nOur ruling\n\nMusk said Biden’s strategy is to \"get as many illegals in the country as possible\" and \"legalize them to create a permanent majority.\"\n\nThe path to U.S. citizenship, which is required for voting in federal elections, can take a decade, so the current influx of immigrants would not lead to a significant number of new voters for many years, if ever.\n\nEven when immigrants become voting citizens, it doesn’t mean the United States will become a one-party nation.\n\nBiden currently supports a Senate immigration bill that does not create a broad path to citizenship.\n\nWe rate this statement False.\n\nRELATED: No, the Senate immigration bill does not allow 5,000 people to illegally enter the U.S. daily\n\nRELATED: Trump's claim that millions of immigrants are signing up to vote illegally is Pants on Fire!"
        },
        {
            "title": "Fact check: Elon Musk's claim that Democrats are avoiding deportations to win elections is False.",
            "content_url": "https://www.politifact.com/factchecks/2024/mar/06/elon-musk/fact-check-elon-musks-claim-that-democrats-are-avo/",
            "authors": [
                "Maria Ramirez Uribe",
                "Amy Sherman"
            ],
            "_robots": "all",
            "published_at": "2024-03-06 00:00:00",
            "text": "Following news reports about immigrants in the U.S. illegally suspected in violent attacks in New York City and Georgia, Elon Musk accused Democrats of avoiding deportation to win at the ballot box.\n\n\"Dems won’t deport, because every illegal is a highly likely vote at some point,\" Musk wrote on X Feb. 26. \"That simple incentive explains what seems to be insane behavior.\"\n\nMusk’s post also referred to immigrants illegally in the U.S. who are accused of assaulting New York City police officers. New York Gov. Kathy Hochul, a Democrat, said that the reported migrants who were recorded on video assaulting police should be deported.\n\nMusk’s post shared another person’s X post about the murder of Laken Riley, a 22-year-old University of Georgia nursing student who was killed Feb. 22 while on a run. Authorities charged Jose Ibarra, a 26-year-old from Venezuela, with the murder.\n\nU.S. Customs and Border Protection stopped Ibarra when he illegally crossed the U.S.-Mexico border in September 2022, according to Immigration and Customs Enforcement. Ibarra was paroled in, allowing him to be released into the U.S. to await further immigration proceedings.\n\nThe Nashville Tea Party, a conservative group, posted Musk’s statement on Instagram about a week later.\n\nThis post was flagged as part of Meta’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Meta, which owns Facebook and Instagram.)\n\nMusk has repeatedly posted similar statements about Democrats \"importing voters\" or illegal immigrants and voters.\n\nThese statements by Musk — and similar ones by former President Donald Trump and J,D, Vance, now a Republican U.S. Senator from Ohio — are wrong.\n\nWe contacted X’s press team asking for Musk’s evidence and received an automated response: \"Busy now, please check back later.\"\n\nDemocratic presidents have removed, returned or expelled millions of people\n\nPresidents, including Democrats, have removed and returned immigrants who are in the U.S. illegally for years, as federal government data shows.\n\nDavid Bier, associate director of immigration studies at the libertarian Cato Institute, said Musk’s statement is \"ludicrously untrue.\"\n\nBier pointed to data from the Department of Homeland Security showing that Biden and former Democratic presidents Barack Obama and Bill Clinton have returned, removed or expelled millions of people.\n\nDuring each of his terms, Obama removed and returned more people than Trump did.\n\nThere have been more than 3.6 million removals, returns and expulsions from February 2021, Biden’s first month in office, to September 2023, based on Department of Homeland Security estimates.\n\nVoting by immigrants in the U.S. illegally carries serious risks\n\nFederal law requires U.S. citizenship to vote in national elections, and would-be voters sign a form that attests under penalty of perjury that they are citizens when they register to vote. States can check databases to verify voters’ citizenship.\n\nVoting by noncitizens carries high risks that include deportation or incarceration.\n\nThere are incidents of noncitizens voting in elections, but they are sporadic among millions of votes cast in federal elections. Immigrants who cross the border illegally are typically looking for jobs and many are escaping poverty or crime — most don’t want to risk drawing government authorities’ attention by casting a ballot.\n\n\"There is a massive economic incentive to migrate here illegally,\" Bier wrote on X. \"There’s a massive economic disincentive to vote illegally.\"\n\nAs we explained in a recent fact-check of Trump, fraudulent voter registration or voting by noncitizens often results from misunderstandings or errors. For example, some noncitizens accidentally register to vote when applying for a driver’s license. But the number of people who fall into this category is \"minuscule,\" Rutgers University political science professor Lorraine Minnite previously told us.\n\nIn 2020, federal prosecutors charged 19 people in North Carolina with voter fraud after they cast ballots mostly in the 2016 election. Sixteen people pleaded guilty, mostly to misdemeanors related to voting as a noncitizen; three cases were dismissed.\n\nThat was a big case, but more than 4.5 million people in North Carolina voted in the 2016 presidential election.\n\nIt takes years for immigrants to gain the right to vote.\n\nIt takes several years for an immigrant to become a citizen and gain voting rights.\n\n\"It takes on average five years in green card status before a person can become a U.S. citizen, so no one would instantly gain the right to vote,\" Michelle Mittelstadt, a spokesperson for the nonpartisan Migration Policy Institute, previously told PolitiFact.\n\nNot all immigrants who become citizens will vote. The U.S. Census Bureau reported that in the 2022 election, native-born citizen voter turnout was 53.4%, exceeding the 41.4% turnout of naturalized citizens.\n\nThere is some evidence that immigrants lean left, but there are variations depending on their backgrounds and where they live.\n\nA 2023 national poll by KFF and the Los Angeles Times found that 37% of naturalized citizens say the Democratic Party represents their views better than the Republican party while 21% say the Republican Party does. But large shares of poll respondents leaned toward neither party.\n\nBut there is no guarantee that immigrants who become citizens in the future will vote for Democrats.\n\nBier told us that \"there is zero evidence that immigration has harmed Republican Party prospects.\" Congressional Republicans have performed much better during periods when the immigrant share of the population is high, Bier wrote in 2019.\n\nOur ruling\n\nMusk said Democrats don’t deport immigrants in the U.S. illegally \"because every illegal is a highly likely vote at some point.\"\n\nMusk provided no evidence to support his statement about deportation or voting. The Biden administration, and previous Democratic administrations, have deported millions of immigrants.\n\nImmigrants cannot vote until they become citizens, a process that takes several years.\n\nWe rate this statement False."
        },
        {
            "title": "Trump's claim that millions of immigrants are signing up to vote illegally is Pants on Fire!",
            "content_url": "https://www.politifact.com/factchecks/2024/jan/12/donald-trump/trumps-claim-that-millions-of-immigrants-are-signi/",
            "authors": [
                "Amy Sherman"
            ],
            "_robots": "all",
            "published_at": "2024-01-12 00:00:00",
            "text": "Former President Donald Trump’s final push before the Iowa caucuses came with warnings about an outrageous Democratic scheme to register immigrants in the country illegally to vote.\n\n\"That’s why they are allowing these people to come in — people that don’t speak our language — they are signing them up to vote,\" Trump said Jan. 5 in Sioux Center, Iowa. \"And I believe that’s why you are having millions of people pour into our country and it could very well affect the next election. That’s why they are doing it.\"\n\nTrump didn’t directly identify who \"they\" are but in his preceding comments, he talked about people who \"cheat on an election\" — language he often uses to talk about Democrats.\n\nTrump’s statements in majority-white Iowa, which holds its caucuses Jan. 15, fit in with conspiracy theories about \"white replacement\" or the \"great replacement,\" which claim white people of European descent are deliberately being replaced with nonwhite people.\n\nTrump has said false claims about immigrants voting in 2014, in 2016 as a presidential candidate, and again in 2020 after his reelection loss.\n\nThere is nothing new about this claim in 2024. Our search for evidence turned up sporadic cases of noncitizens registering to vote or casting ballots. But we found no effort by the left to register people in the country illegally.\n\n\"There is zero evidence that institutionally the Democratic Party has been doing this,\" said Mike Madrid, a longtime Republican strategist in California who produces the Latino Vote podcast with Chuck Rocha, a Democratic political consultant. We asked Trump’s campaign for evidence and received no a reply.\n\nVoting by immigrants in U.S. illegally is rare\n\nFederal law requires citizenship to vote in national elections, and would-be voters sign a form attesting under penalty of perjury that they are citizens when they register to vote. States can check databases to verify voters’ citizenship.\n\nFraudulent voter registration or voting by noncitizens is often a result of misunderstandings or errors. For example, some noncitizens accidentally register to vote when applying for a driver’s license. But the number of people who fall into this category is \"minuscule,\" Rutgers University political science professor Lorraine Minnite previously told us.\n\nIn Colorado, ahead of the 2022 midterm election, the secretary of state’s office mistakenly sent postcards to about 30,000 noncitizens who had driver’s licenses encouraging them to register to vote. The office sent a second postcard notifying these noncitizens about the error and worked with county clerks to ensure the ineligible voters did not register.\n\nIn 2020, federal prosecutors charged 19 people in North Carolina with voter fraud after they cast ballots mostly in the 2016 election. Sixteen people pleaded guilty, mostly to misdemeanors related to voting as a noncitizen. Three cases were dismissed.\n\nThat was a big case, but keep in mind that more than 4.5 million people in North Carolina voted in the 2016 presidential election.\n\nAn investigation in Georgia found 1,634 noncitizens who attempted to register to vote over 25 years, Secretary of State Brad Raffensperger said in 2022. Ultimately, no one was registered.\n\n\"The system worked to prevent illegal voting,\" said John Melvin, chief assistant district attorney in Gwinnett County, home to part of Atlanta.\n\nNoncitizens who vote could face serious consequences\n\nVoting by noncitizens carries high risks that include deportation or incarceration.\n\nInteracting with the government, including trying to vote, is something the undocumented population tries to avoid, said Madrid, the Republican strategist. \"They are not going to go register to vote and expose themselves.\"\n\nThe penalties are also high for a political party or volunteer who would try to sign up an ineligible voter.\n\n\"There are so many millions of citizens of eligible voting age, Latinos, that are not registered,\" Madrid said. It makes more sense to focus on them, he said.\n\nRepublicans sometimes object to some communities allowing certain noncitizens to vote in local elections. Takoma Park, Maryland, has allowed it since 1993. But, again, noncitizens aren't allowed to vote in presidential races.\n\n\"There is no indication that noncitizen voting in those localities has caused noncitizen voting in state or federal elections,\" said Wendy R. Weiser, a lawyer at the Brennan Center for Justice at the New York University School of Law.\n\nIt’s a long path for immigrants to gain the right to vote\n\nThe process of becoming a citizen — and the right to vote that comes with it — can take a decade or longer.\n\nBorder officials have encountered migrants nationwide 8.1 million times under President Joe Biden’s administration, as of November 2023. (If one person tries to enter the country three times and is stopped each time by border officials, that equals three encounters.) Also, not everyone encountered is let into the U.S. About 3.6 million encounters ended in people being deported from the country under Biden, DHS data shows.\n\n\"Even if many of these people found a path to legal status via asylum or other means, it would be many, many years before they would become eligible to vote given both the huge backlogs in adjudicating cases in immigration court and the fact that people spend years on a green card before being eligible for citizenship,\" Michelle Mittelstadt, a Migration Policy Institute spokesperson, previously told PolitiFact.\n\nOur ruling\n\nTrump said Democrats are allowing illegal immigrants \"to come in — people that don’t speak our language — they are signing them up to vote.\"\n\nTrump provided no evidence for this scheme. Only U.S. citizens can vote in federal elections, and proven incidents of noncitizens casting ballots are rare. Even immigrants who arrive now and apply for citizenship won’t be able to vote for more than a decade because of the lengthy citizenship process.\n\nWe rate this statement Pants on Fire!\n\nStaff Writer Maria Ramirez Uribe contributed to this fact-check."
        },
        {
            "title": "Sen. Rick Scott said 3 states removed thousands of noncitizens on voter rolls. Here’s what we know",
            "content_url": "https://www.politifact.com/factchecks/2024/aug/29/rick-scott/sen-rick-scott-said-3-states-removed-thousands-of/",
            "authors": [
                "Samantha Putterman",
                "Amy Sherman"
            ],
            "_robots": "all",
            "published_at": "2024-08-29 00:00:00",
            "text": "Republican politicians from multiple states say noncitizen voting is rampant and they are doing whatever they can to stop it.\n\nU.S. Sen. Rick Scott, R-Fla., wants lawmakers to vote on a federal bill that aims to prevent noncitizen voting. Congress blocked noncitizens from voting in federal elections in 1996.\n\n\"Illegals SHOULD NOT BE VOTING in American elections,\" Scott wrote Aug. 28 on X, linking to a clip of an interview with Newsmax. \"This month alone, more than 16,000 non-citizens have been removed from the voter rolls in 3 states. It’s a serious problem — and as the next Senate GOP Leader I’ll make sure we fix it.\"\n\nScott, who is running for reelection this year, wants to replace Sen. Mitch McConnell of Kentucky as the Senate Republican leader.\n\nDespite evidence that noncitizen voting is rare, Republicans and social media influencers are making it a cornerstone of their election-year messaging.\n\nScott’s Senate office confirmed that he was referring to voters in Texas, Virginia and Alabama.\n\nWe found that Scott’s number has some merit, but he misconstrued some of the details:\n\nScott said the removals happened in August. Republican state officials in these states announced their actions only this month. Texas and Virginia officials said they had been removed during the past few years.\n\nScott used the word \"removed.\" Texas and Virginia officials said they removed the voters. But Alabama moved them from active to inactive status. Alabama’s secretary of state said some of the people might have since become naturalized citizens and are therefore eligible to vote if they update their information.\n\nTexas called the voters \"potential noncitizens.\"\n\nIt’s unclear how many of the 16,000 people voted in an election The voters flagged for citizenship questions add up to less than 1% of those states’ voter rolls.\n\nTexas, Virginia and Alabama state officials have been looking for noncitizens on voter rolls\n\nHere is what we know about the efforts to remove noncitizen voters in three states:\n\nTexas: Republican Gov. Greg Abbott said Aug. 26 that the state removed about 1 million ineligible people from the voter rolls since 2021. Most of them were removed because they had died or moved or didn’t respond to notices sent by election officials.\n\nAdditionally, Abbott wrote, \"of the over 6,500 potential noncitizens removed from the voter rolls, approximately 1,930 have a voter history.\" Those 1,930 were sent to the state attorney general for potential legal action. The word \"potential\" raises the question about whether they were proved to be noncitizens.\n\nThe Dallas Morning News, a PolitiFact Texas partner, reported that those 6,500 people were sent a notice that their voter registration was under examination but did not respond. The notice states that they had 30 days to provide information or documentation establishing their qualifications for voter registration.\n\nA previous effort to clean up Texas’ voter rolls went poorly in 2019 when the state started with an error-filled list of 95,000 potential noncitizens on the voter rolls. The effort led to lawsuits and the secretary of state’s resignation. This time, Texas’ list is much smaller.\n\nAlabama: Republican Secretary of State Wes Allen said in an Aug. 13 statement that his office identified \"3,251 individuals who are registered to vote in Alabama who have been issued noncitizen identification numbers by the Department of Homeland Security.\" Allen did not say how many voted.\n\nAllen instructed county boards of registrars to change the status for those voters to inactive and begin removing noncitizens from the rolls. Allen sent the list to the state’s attorney general for potential prosecution.\n\nAllen said it’s possible that some of the people have since become naturalized citizens and are therefore eligible to vote; but they have to update their information.\n\nBarry Stephenson, chairman of Jefferson County’s Board of Registrars, told PolitiFact his county had 557 voters on that list.\n\n\"They are not being removed — they are moving from active status to inactive,\" Stephenson said. As long as they fill out the form attesting to their citizenship, they can vote.\n\nStephenson told PolitiFact that a couple of people who received a notice called the office and said that they had green cards and didn’t know they were registered to vote. They said they never asked to register to vote while getting a driver’s license.\n\nJefferson County has 47,000 people on the inactive list, so the names the state flagged for citizenship are a small slice.\n\nVirginia: Republican Gov. Glenn Youngkin said in an Aug. 7 executive order that the state removed 6,303 noncitizens from voter rolls from January 2022 to July 2024. Youngkin’s order did not say whether any people cast ballots. Virginia used state Department of Motor Vehicles records and federal Department of Homeland Security data to identify noncitizens. Youngkin’s order stated that they may have \"purposefully or accidentally registered to vote.\"\n\nVoting by noncitizens is rare\n\nElections experts say it is possible for an ineligible voter to accidentally register to vote at the DMV, which could be a mistake by the applicant or the clerk. And it’s possible DMV records on citizenship are outdated.\n\n\"All they know is what your citizenship status was whenever you interacted with the DMV,\" said Jonathan Diaz, an election law expert at the Campaign Legal Center, which promotes voting access. (The center has sent letters to Alabama and Texas officials challenging their recent actions.)\n\nAnthony Gutierrez, executive director of Common Cause Texas, agreed with Diaz: \"The fact that a voter was, at some point, not a citizen, certainly does not mean they voted during the time they were not a citizen.\"\n\nIn 1996, Congress banned noncitizen voting in federal elections as part of a broader toughening of penalties on people in the country illegally. \"Noncitizens\" includes people legally and illegally in the U.S.\n\nSafeguards already exist to prevent noncitizen voting. When people register to vote, they attest that they are citizens. Think tanks, academics, courts and journalists have analyzed claims about noncitizen voting at least since 2016 and have found only sporadic cases that wouldn’t swing federal elections. Penalties for noncitizen voting can include jail time, deportation or denial of citizenship applications.\n\nOne of the largest examples we could find of noncitizens charged for voting stems from North Carolina. In 2020, federal prosecutors charged 19 people in North Carolina with voter fraud after they cast ballots mostly in the 2016 election. Sixteen people pleaded guilty, mostly to misdemeanors related to voting as a noncitizen. Three cases were dismissed.\n\nMore than 4.5 million people in North Carolina voted in the 2016 presidential election.\n\nState election officials routinely take steps to remove ineligible people from the voter rolls in accordance with federal law.\n\nIt could take several months or longer for authorities to determine whether any of the people the three states found on the voter rolls will face criminal charges. Additional information about these efforts could come out in potential lawsuits, meaning it could be years before some unknowns about the current removals are answered.\n\nOur ruling\n\nScott said, \"This month alone, more than 16,000 non-citizens have been removed from the voter rolls in 3 states.\"\n\nScott is talking about something that did happen, but there is a lot we don’t know about the 16,000 total from available information. The outcome of investigations and potential lawsuits could take months or years.\n\nBased on what we know, Scott’s timeframe is off. Not all of these voters were taken off the rolls in August. State officials announced actions related to these voters in August. Texas announced it had removed 6,500 \"potential noncitizens\" since 2021. The word \"potential\" leaves some wiggle room. Virginia said it had \"removed\" 6,303 voters since 2022.\n\nThe names in Alabama — 3,251 — were moved from active to inactive status, but that’s not the same as being removed. They can still vote as long as they sign a form attesting that they are U.S. citizens.\n\nBeing on the voter rolls and casting a ballot are not the same thing. We don’t know how many of the potential noncitizen voters cast ballots; Texas said 1,930 had a Texas voter history. When we add up the numbers on the lists in the three states, it amounts to less than 1% of registered voters.\n\nThe statement is partially accurate but leaves out important details or takes things out of context. We rate it Half True.\n\nRELATED: Trump’s claim that millions of immigrants are signing up to vote illegally is Pants on Fire!\n\nRELATED: ‘An environment of distrust’: How Elon Musk amplifies falsehoods about immigration, 2024 voting"
        },
        {
            "title": "Biden Promise Tracker:",
            "content_url": "https://www.politifact.com/truth-o-meter/promises/biden-promise-tracker/promise/1610/create-pathway-citizenship-nearly-11-million-peopl/",
            "authors": [],
            "_robots": "all",
            "published_at": "None",
            "text": "President Joe Biden campaigned on providing a pathway to citizenship to around 11 million people who were living illegally in the U.S.\n\nThe president can't change immigration laws; Congress must do that. So, on his first day in office, Biden proposed a bill that would create a road map to citizenship for the millions of people in the U.S. illegally. Although Democrats narrowly controlled both the House of Representatives and the Senate during Biden's first two years, the bill stalled.\n\nThree years later, in February 2024, Biden supported an immigration bill a bipartisan group of senators had sponsored that focused on border security and did not include a pathway to citizenship. The measure sought to raise the initial asylum screening standard and created an emergency power to essentially deny asylum to people crossing the U.S. border between ports of entry.\n\nThe bill failed to pass the Senate twice. President-elect Donald Trump urged its demise.\n\nIn June 2024, Biden announced a policy change that would help people, who are in the U.S. illegally, get citizenship if they were married to or the children of U.S. citizens.\n\nThat's because although being an immediate relative of, or married to, a U.S. citizen are among the limited ways people can gain permanent residency and eventual citizenship, people who entered the U.S. illegally and have these familial connections face life-altering barriers to acquiring that privilege: They must leave the U.S. and reenter legally to get permanent residency. But because they lived in the U.S. illegally, when they leave the country, immigration law bans them from reentering the U.S. for up to 10 years.\n\nBiden's program includes \"parole in place,\" a protection to let people who qualify stay in the U.S. as they apply for permanent residency. (Three years after getting permanent residency, people can apply for citizenship.)\n\nThe White House said the policy, if adopted, would help 500,000 spouses and 50,000 stepchildren of U.S. citizens. However, Texas sued the Biden administration to stop it, and in November, a federal judge ruled the program illegal.\n\nBiden did not provide a pathway to citizenship for millions of immigrants who are illegally in the U.S.\n\nWe rate this Promise Broken.\n\nBorder officials have encountered a historically high number of immigrants crossing the border illegally during President Joe Biden's administration. These record-breaking statistics have been used to criticize Biden's management of the border and to impeach his Department of Homeland Secretary, Alejandro Mayorkas. They've also derailed some of the promises Biden made during his 2020 presidential campaign.\n\nBiden promised to create a pathway to citizenship for millions of immigrants living in the U.S. illegally. On his first day in office, Biden proposed a bill that would have done that, but the bill didn't go anywhere. Three years later, the promise remains unfulfilled.\n\nIn February, a bipartisan group of senators unveiled an immigration bill intended to reduce illegal immigration at the U.S.-Mexico border. Biden said he would sign it into law if it reached his desk.\n\nBut the bill, which failed in the Senate with a 49-50 vote, did not include a path to citizenship for people living in the U.S. illegally. Instead, it sought to raise the initial asylum screening standard and created an emergency power to essentially deny asylum to people crossing the U.S. border between ports of entry.\n\nThe prospect of Biden signing a bill granting a pathway to citizenship seems unlikely in a Republican-controlled House. We'll continue to monitor this promise, but for now, we rate it Stalled.\n\nPresident Joe Biden's chances of signing legislation that fulfills his promise to provide a path to citizenship for 11 million immigrants in the U.S. illegally have dwindled now that Republicans control the House of Representatives.\n\nOn his first day in office, Biden proposed the U.S. Citizenship Act of 2021 to provide a citizenship path for farmworkers and immigrants who came to the U.S. illegally as children and for beneficiaries of Temporary Protected Status. House Democrats introduced the bill in February 2021, but it did not advance.\n\nBecause budgetary bills don't require a 60-vote majority in the Senate, Democrats set their sights on the fiscal year 2022 spending bill as an avenue to pass a pathway to citizenship for the same group of immigrants in the 2021 citizenship act. But the Senate's parliamentarian, who decides what can and cannot be included in the budget reconciliation process, ruled against the Democrats' three attempts to include immigration reform in the bill.\n\nAfter the November midterm elections, Sen. John Cornyn, R-Texas, and Kyrsten Sinema, I-Ariz., introduced an immigration bill that would have strengthened border security and provided a path to citizenship for some immigrants who came to the U.S. illegally as children. The proposal, which would have needed 60 votes, did not advance to the Senate floor.\n\nAfter visiting the southwest border Jan. 9, a bipartisan group of senators — including Cornyn and Sinema — said they would once again discuss an immigration bill. But with Republicans in charge of the House, the possibilities of a bill granting a path to citizenship are limited, said Theresa Cardinal Brown, managing director of immigration and cross-border policy at the Bipartisan Policy Center.\n\nRepublicans in Congress are pushing for more resources and security at the border, while Democrats seek paths to citizenship for immigrants in the country illegally. But neither party has enough votes to pass the bills they want.\n\n\"The bridge between the parties on some of these issues has grown wider and harder to make the necessary negotiations and concessions to get enough votes from the other party to pass legislation,\" Cardinal Brown said.\n\nImmigrants who came to the U.S. illegally as children are more likely to benefit from legislation, said Cardinal Brown. Both Republican and Democratic lawmakers have generally expressed support for this group of immigrants. The U.S. Supreme Court this year is expected to rule on the legality of Deferred Action for Childhood Arrivals, an Obama-era program that protects certain young immigrants from deportation.\n\nThe possibility of a bill providing 11 million immigrants with a path to citizenship is limited, especially with Republican control of the House.\n\nWe rate this promise Stalled.\n\nDemocratic lawmakers have introduced a bill to advance President Joe Biden's campaign promise to create a pathway to citizenship for millions of immigrants living in the United States illegally.\n\nThe U.S. Citizenship Act of 2021 would offer an expedited three-year path to citizenship to some farmworkers, so-called Dreamers (immigrants who arrived here illegally when they were children) and people who currently benefit from a Temporary Protected Status designation.\n\nIncluding spouses and minor children of the eligible immigrants, nearly 3.3 million people would be on track for the expedited path to citizenship, according to the Migration Policy Institute, a nonpartisan think tank.\n\nOther immigrants without legal authorization to be in the country would be on a longer, eight-year path to citizenship, provided they pass background checks and pay taxes.\n\nThe congressional effort is led by Sen. Bob Menendez, D-N.J., and Rep. Linda Sanchez, D-Calif. In a Feb. 18 statement, Biden applauded the proposal.\n\n\"I look forward to working with leaders in the House and Senate to address the wrongdoings of the past administration and restore justice, humanity and order to our immigration system,\" Biden said. \"This is an important first step in pursuing immigration policies that unite families, grow and enhance our economy, and safeguard our security.\"\n\nWe did not find statements from Republicans in Congress publicly supporting the proposal.\n\nRepublican lawmakers have previously expressed support for a pathway to citizenship for immigrants who were brought to the country as children. But Republicans have been more reluctant to support a bill that benefits a broader group of immigrants. Rep. John Katko, the top Republican in the House Committee on Homeland Security, said the new bill fell short on border security and called it \"more of a symbolic marker than a viable product for congressional debate.\"\n\nBeyond providing a pathway to citizenship, the bill also seeks to reduce visa backlogs, eliminate per-country admission caps, get rid of the one-year deadline for filing asylum claims, and expand access to some visas, including the U visa available to victims of certain crimes who assist law enforcement investigations.\n\nThe bill also aims to advance another Biden campaign promise to help Central American nations address the factors driving migrants out of their countries. The proposal calls for funding to improve infrastructure at ports of entry and to secure the border through the use of technology.\n\nWhether the bill gains enough support to become a law is still to be determined. For now, given the introduction of the proposal in Congress, we rate this promise In the Works."
        },
        {
            "title": "Email interview, David Bier, director of immigration studies at the Cato Institute, Feb. 21, 2025"
        },
        {
            "title": "The Latino Century: How America's Largest Minority Is Transforming Democracy: Madrid, Mike: 9781668015261: Amazon.com: Books",
            "content_url": "https://www.amazon.com/Latino-Century-Americas-Transforming-Democracy/dp/1668015269",
            "authors": [],
            "_robots": null,
            "published_at": "None",
            "text": "Customer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\n\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\n\nLearn more how customers reviews work on Amazon"
        },
        {
            "title": "Email interview, Anthony Gutierrez, Common Cause Texas executive director, Feb. 21, 2025"
        },
        {
            "title": "Email interview, Mark Lopez, managing director of race & ethnicity research.at Pew Research Center, Feb. 21, 2025"
        },
        {
            "title": ""
        }
    ],
    "news sources": [],
    "_meta": {
        "politoco": {
            "page url": "https://www.politifact.com/factchecks/2025/feb/21/elon-musk/fact-check-elon-musk-cpac-bidens-immigration-polic/",
            "page content": "PolitiFact | No, Joe Biden did not have a 'voter importation' plan. Fact-checking Elon Musk's false CPAC claim. The Poynter Institute Menu Donate State Editions California Florida Iowa Michigan New Hampshire New York North Carolina Pennsylvania Texas West Virginia Wisconsin Issues All Issues Online hoaxes Coronavirus Health Care Immigration Extremism Taxes Marijuana Environment Crime Guns Foreign Policy LGBTQ+ People Donald Trump JD Vance Mitch McConnell Mike Johnson Joe Biden Media PunditFact Tucker Carlson Sean Hannity Rachel Maddow Bloggers PolitiFact Videos Campaigns 2024 Elections Truth-o-Meter True Mostly True Half True Mostly False False Pants on Fire Promises MAGA-Meter Biden Promise Tracker Trump-O-Meter Obameter Latest Promises About Us Our Process Our Staff En Español Who pays for PolitiFact? Advertise with Us Suggest a Fact-check Corrections and Updates Newsletters Donate Follow us The Facts Newsletter Sign up English Español Stand up for the facts! Our only agenda is to publish the truth so you can be an informed participant in democracy. We need your help. More Info I would like to contribute One Time Monthly Yearly Join Now Elon Musk stated on February 20, 2025 in a speech at CPAC: President Joe Biden’s immigration policy was “a giant voter importation scam.” Immigration National Elections Elon Musk Elon Musk hold a chainsaw as he arrives to speak at the Conservative Political Action Conference, CPAC, at the Gaylord National Resort & Convention Center, Feb. 20, 2025, in Oxon Hill, Md. (AP) By Maria Ramirez Uribe February 21, 2025 By Amy Sherman February 21, 2025 No, Joe Biden did not have a 'voter importation' plan. Fact-checking Elon Musk's false CPAC claim. If Your Time is short There were more than 4.5 million removals, returns and expulsions from February 2021, President Joe Biden’s first month in office, to November 2024. It takes several years for immigrants to become citizens, a requirement to vote in federal elections. See the sources for this fact-check When he wasn’t waving a bureaucracy chainsaw at the Conservative Political Action Conference, Elon Musk revived false campaign rhetoric about former President Joe Biden trying to import voters illegally. In a Feb. 20 interview, Newsmax host Rob Schmitt asked, \"You think they were creating a new voter class? You think that was the goal when they opened up the borders for four years?\" Musk said Biden had a political incentive to \"maximize\" people in the country illegally. \"That is why the Biden administration was pushing to get in as many illegals as possible and spend every dollar possible to get as many, because every one of them is a customer,\" Musk said . \"Everyone's a voter. The whole thing was a giant voter importation scam.\" Musk, now involved with President Donald Trump’s commission to cut government spending, repeated falsehoods he spread early in the 2024 election year that Biden had an election strategy to import voters through illegal immigration. We emailed the White House press office asking for evidence and did not hear back. Sign up for PolitiFact texts Biden stepped up immigration enforcement during the election year There were historically high levels of illegal immigration during the Biden administration, but there is no evidence that Biden \"imported\" those people to become voters. Factors such as natural disasters and economic or political turmoil in a persons’ home country lead people to migrate. Additionally, Musk’s statement ignored that the Biden administration removed and deported immigrants in the U.S. illegally, and it stepped up efforts in 2024 as he ran for reelection. (He dropped out in July.) The Biden administration removed, returned or expelled more than 4.5 million people from February 2021, Biden’s first full month in office, to November 2024, the latest month with available data . Illegal immigration has generally dropped since March 2024, and it dropped significantly after June, when Biden implemented a policy limiting people’s ability to apply for asylum at the southwest border. For example, there were more than 137,000 southwest border encounters in March 2024 and 47,000 in December. \"Biden was trying to deport as many border crossers as he could, so I don’t see any evidence he wanted these people in the United States,\" said David Bier, an immigration expert at the libertarian Cato Institute. \"He campaigned as being anti-illegal immigration. He never courted their votes, and he could not court their votes because they cannot vote and do not vote. Saying ‘every one of them was a voter’ is as divorced from reality as anything you could possibly say.\" It takes several years for immigrants to become citizens Federal law requires U.S. citizenship to vote in national elections, and would-be voters sign a form that attests under penalty of perjury that they are citizens when they register to vote. The citizenship process takes several years. \"It takes on average five years in green card status before a person can become a U.S. citizen, so no one would instantly gain the right to vote,\" Michelle Mittelstadt, a spokesperson for the nonpartisan Migration Policy Institute, previously told PolitiFact . Musk acknowledged at CPAC that it might take years for immigrants to gain citizenship, but it would be \"an investment that is guaranteed to pay off.\" Immigrants who arrive illegally have higher hurdles to clear before becoming citizens and voting. The Biden administration failed in its efforts to pass a law with a pathway to citizenship, and no such legislation is expected during the Trump administration. Which party would have the ‘immigrant’ advantage? There is no guarantee that immigrants who become citizens will vote, or vote for Democrats. Although the southwest border gets the most attention, immigrants who come illegally are not from Latin America only. Mike Madrid, a Republican strategist in California and author of the book \" The Latino Century ,\" said Republicans won the largest national Hispanic vote share in 2024 than in presidential elections in recent cycles. Featured Fact-check Donald Trump stated on January 22, 2025 in an interview The U.S. House Select Committee that investigated the Jan. 6, 2021, attack on the U.S. Capitol “deleted and destroyed all of the information that they collected over two years.” By Samantha Putterman • January 24, 2025 Immigrants, including Hispanics, view the Republican Party as focused on economic issues and the Democratic Party as focused on cultural issues, Madrid said. The New York Times documented a conservative shift among immigrants after the 2020 election. Its analysis of voting in 28,000 precincts in more than 20 cities found that immigrant-dense neighborhoods with large populations of Latinos and residents of Asian descent had a surge in turnout and shifted to the right. \"There is zero evidence that immigration has harmed Republican Party prospects,\" Bier previously told us . Eligible naturalized citizens comprise about 10% of voters, Pew Research Center found in 2024. Voting by noncitizens is rare There are incidents of noncitizens voting in elections, but they are sporadic among millions of votes cast in federal elections. Immigrants who cross the border illegally are typically looking for jobs and many are escaping poverty or crime — most don’t want to risk drawing government authorities’ attention by casting a ballot. Voting by noncitizens carries high risks that include deportation if they are here illegally or incarceration. Fraudulent voter registration or voting by noncitizens often results from misunderstandings or errors. For example, some noncitizens accidentally register to vote when applying for a driver’s license. Our ruling Musk said Biden’s immigration policy was \"a giant voter importation scam.\" There is no evidence that the Biden administration was bringing in people illegally to cast votes. Government data shows more than 4.5 million removals, returns and expulsions during Biden’s tenure. Biden stepped up these actions during the election year. It takes several years for immigrants to become citizens and therefore eligible to vote. Immigrants who came to the U.S. illegally cannot vote and would have to overcome hurdles to become citizens. We rate this statement Pants on Fire. RELATED : All of our fact-checks of Elon Musk Read About Our Process The Principles of the Truth-O-Meter Our Sources Austin American-Statesman, Interview with Elon Musk at CPAC, Feb. 20, 2025 David Bier at the CATO Institute, Biden Didn’t Cause the Border Crisis, Part 1: Summary, Jan. 16 , 2025 Texas Secretary of State Jane Nelson, Texas Has 18.6 Million Registered Voters , Oct. 19, 2024 Office of Homeland Security, Immigration Enforcement and Legal Processes Monthly Tables , Jan. 16, 2025 Pew Research Center, 1 in 10 eligible voters in the U.S. are naturalized citizens , Sept. 19, 2024 Pew Research Center, What we know about unauthorized immigrants living in the U.S. July 22, 2024 New York Times, Immigrant Neighborhoods Shifted Red as the Country Chose Blue , Dec. 20, 2020 VoteBeat, Gov. Greg Abbott boasted that Texas removed 6,500 noncitizens from its voter rolls. That number was likely inflated . Oct. 15, 2024 PolitiFact, The White House exaggerated how sharply illegal immigration has dropped. Here’s what you should know , Feb. 20, 2025 PolitiFact, Elon Musk is wrong to say Joe Biden is recruiting immigrants to create a Democratic majority , Feb. 6, 2024 PolitiFact, Fact check: Elon Musk's claim that Democrats are avoiding deportations to win elections is False. March 6, 2024 PolitiFact, Trump's claim that millions of immigrants are signing up to vote illegally is Pants on Fire! Jan. 12, 2024 PolitiFact, Sen. Rick Scott said 3 states removed thousands of noncitizens on voter rolls. Here’s what we know , Aug. 29, 2024 PolitiFact, Biden broke his promise to provide citizenship to millions of immigrants in the U.S. illegally, Dec. 18, 2024 Email interview, David Bier, director of immigration studies at the Cato Institute, Feb. 21, 2025 Telephone interview, Mike Madrid, author of The Latino Century , Feb. 21, 2025 Email interview, Anthony Gutierrez, Common Cause Texas executive director, Feb. 21, 2025 Email interview, Mark Lopez, managing director of race & ethnicity research.at Pew Research Center, Feb. 21, 2025 Browse the Truth-O-Meter More by Maria Ramirez Uribe Elon Musk stated on February 20, 2025 in a speech at CPAC: President Joe Biden’s immigration policy was “a giant voter importation scam.” By Maria Ramirez Uribe • February 21, 2025 Elon Musk stated on February 10, 2025 in an X post: “FEMA sent $59M LAST WEEK to luxury hotels in New York City to house illegal migrants… That money is meant for American disaster relief.” By Maria Ramirez Uribe • February 14, 2025 Kristi Noem stated on February 2, 2025 in an interview: At Guantánamo Bay, “we'll have the capacity to continue to do there what we've always done. We've always had a presence of illegal immigrants there that have been detained.” By Maria Ramirez Uribe • February 9, 2025 Donald Trump stated on January 30, 2025 in a press briefing: “I changed the Obama policy (on hiring air traffic controllers) ... And then Biden came in and he changed it.” By Caleb McCullough • January 31, 2025 Karoline Leavitt stated on January 28, 2025 in a press conference: “DOGE and OMB also found that there was about to be $50 million taxpayer dollars that went out the door to fund condoms in Gaza.” By Caleb McCullough • January 30, 2025 Nancy Pelosi stated on November 9, 2024 in an interview: “Fewer people came in under President Biden than came under Donald Trump.” By Maria Ramirez Uribe • November 15, 2024 Facebook posts stated on October 30, 2024 in a Facebook post: Photos show Keanu Reeves hawking T-shirts with political messages. By Maria Ramirez Uribe • November 8, 2024 Threads posts stated on November 6, 2024 in a Threads post: “I think they found a way to target Democratic districts and send millions of votes into a black hole. The numbers aren't adding up.” By Maria Ramirez Uribe • November 7, 2024 X posts stated on November 2, 2024 in a post on X: An image shows CNN reporting that Vice President Kamala Harris has more votes than former President Donald Trump in Texas. By Maria Ramirez Uribe • November 4, 2024 Instagram posts stated on October 18, 2024 in an Instagram post: As part of his “charitable donations,” in 1990 Donald Trump “chartered a private plane to get Nelson Mandela to America when the U.S. government wouldn't help.\" By Maria Ramirez Uribe • October 19, 2024 Instagram posts stated on October 7, 2024 in una publicación en Instagram: La administración de Joe Biden tomó dinero de ayudas de FEMA para usarlo en inmigrantes. By Maria Briceño • October 16, 2024 Kamala Harris stated on October 7, 2024 in an interview: “We have cut the flow of fentanyl by half.” By Maria Ramirez Uribe • October 11, 2024 Donald Trump stated on October 4, 2024 in a conversation with reporters: The Biden administration stole $1 billion “from FEMA to use it for illegal migrants. … And FEMA is now busted. They don’t have any money.” By Maria Ramirez Uribe • October 8, 2024 X posts stated on September 28, 2024 in una publicación en X: “Kamala Harris permitió la entrada a Estados Unidos de 13.000 extranjeros ilegales condenados por asesinato\". By Marta Campabadal Graus • October 7, 2024 Elon Musk stated on October 2, 2024 in a post on X: With U.S. Customs and Border Protection’s CBP One app, it “takes less than 5 minutes and zero documentation to get approved as an illegal immigrant and be flown to the United States with air tickets paid for by the American taxpayer.” By Jeff Cercone • October 4, 2024 No, Joe Biden did not have a 'voter importation' plan. Fact-checking Elon Musk's false CPAC claim. Clear Any Rating True Mostly True Half True Mostly False False Pants on Fire Full Flop Half Flip No Flip Any Speaker Any Date Range Last 3 Months Last 6 Months Last 12 Months 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 Any Category Elon Musk stated on February 20, 2025 in a speech at CPAC: President Joe Biden’s immigration policy was “a giant voter importation scam.” By Maria Ramirez Uribe • February 21, 2025 Facebook posts stated on February 17, 2025 in una publicación en Facebook: El congresista Adriano Espaillat muestra “La nueva bandera que están promoviendo para República Dominicana que se va a llamar 'DominicoHaiti'”. By Maria Briceño • February 21, 2025 Social Media stated on February 7, 2025 in a post: “US Debt Clock” numbers prove “DOGE has saved taxpayers $64 billion dollars in just 17 days.” By Sara Swann • February 21, 2025 Facebook posts stated on February 20, 2025 in a Facebook post: Video shows White House Press Secretary Karoline Leavitt saying Americans can get $4,800 subsidy because Department of Government Efficiency cuts found “extra money.” By Jeff Cercone • February 21, 2025 Instagram posts stated on February 16, 2025 in an Instagram post: Says Barron Trump posted on X, “We’re on the brink of uncovering a dark legacy in this country that’s been hidden for far too long.” By Ciara O'Rourke • February 21, 2025 Viral image stated on February 17, 2025 in a Threads post: Says Elon Musk said on X, “Spoiled crybabies across the country are protesting against America’s golden age. Brats like them should go to prison.” By Ciara O'Rourke • February 21, 2025 Facebook posts stated on February 15, 2025 in an Instagram post: “The very LIBERAL 9th Circuit Court has ruled that 84 of Biden's last-minute pardons are unconstitutional.” By Ciara O'Rourke • February 21, 2025 Facebook posts stated on February 12, 2025 in a Facebook post: Video shows Barron Trump singing on “America’s Got Talent.” By Ciara O'Rourke • February 21, 2025 Nancy Mace stated on February 20, 2025 in an X post: “You either have XX or XY chromosomes. Those are the options.” By Grace Abels • February 21, 2025 Threads posts stated on February 18, 2025 in a Threads post: A photo shows Jonathan Simpson, the pilot of “Delta’s crash in Toronto, Canada.” By Sofia Ahmed • February 20, 2025 Load more Support independent fact-checking. Become a member! In a world of wild talk and fake news, help us stand up for the facts. Sign me up Offices District of Columbia 1800 I Street NW Washington, DC 20006 Florida 801 3rd St. S St. Petersburg, FL 33701 727-821-9494 People Donald Trump JD Vance Mitch McConnell Mike Johnson Joe Biden State Editions California Florida Iowa Michigan New Hampshire New York North Carolina Pennsylvania Texas West Virginia Wisconsin About Us Our Process Our Staff En Español Who pays for PolitiFact? Advertise with Us Corrections and Updates Newsletters RSS Feeds Recent Articles and Fact-checks Recent Fact-checks Suggest a Fact-check Follow us The Facts Newsletter Sign up Terms & Conditions Privacy Policy Copyright ©All Rights Reserved Poynter Institute 2020, a 501(c)(3) nonprofit organization"
        }
    },
    "_internal_claim_id": "2d9a9d81-4774-48a8-9f7a-07bb2610333d",
    "_search query": "President Joe Bidens immigration policy was a giant voter importation scam",
    "_data extracted date": "2025-03-16 12:21:05.144096"
}